<h3><b>Introduction to Data Analytics - Exercise set 2 - pandas-module</b></h3>

<h4><b>1. import pandas and read the csv-file found in Moodle (loans.csv). Use Python coding with pandas to answer the questions.</b></h4>

In [1]:
import pandas as pd
import numpy as np

# Read csv file to DataFrame
df = pd.read_csv('loans.csv')

<li>Remove the Customer ID â€“column from data</li>
<li>Print the head of the data</li>

In [2]:
# remove the column and print out the head of the DataFrame
df = df.drop('Customer ID', axis=1)
df.head()

,Loan ID,Loan Status,Current Loan Amount,Term,Credit Score,Annual Income,Years in current job,Home Ownership,Purpose,Monthly Debt,Years of Credit History,Months since last delinquent,Number of Open Accounts,Number of Credit Problems,Current Credit Balance,Maximum Open Credit,Bankruptcies,Tax Liens
0,14dd8831-6af5-400b-83ec-68e61888a048,Fully Paid,445412.0,Short Term,709.0,1167493.0,8 years,Home Mortgage,Home Improvements,5214.74,17.2,NaN,6.0,1.0,228190.0,416746.0,1.0,0.0
1,4771cc26-131a-45db-b5aa-537ea4ba5342,Fully Paid,262328.0,Short Term,NaN,NaN,10+ years,Home Mortgage,Debt Consolidation,33295.98,21.1,8.0,35.0,0.0,229976.0,850784.0,0.0,0.0
2,4eed4e6a-aa2f-4c91-8651-ce984ee8fb26,Fully Paid,99999999.0,Short Term,741.0,2231892.0,8 years,Own Home,Debt Consolidation,29200.53,14.9,29.0,18.0,1.0,297996.0,750090.0,0.0,0.0
3,77598f7b-32e7-4e3b-a6e5-06ba0d98fe8a,Fully Paid,347666.0,Long Term,721.0,806949.0,3 years,Own Home,Debt Consolidation,8741.90,12.0,NaN,9.0,0.0,256329.0,386958.0,0.0,0.0
4,d4062e70-befa-4995-8643-a0de73938182,Fully Paid,176220.0,Short Term,NaN,NaN,5 years,Rent,Debt Consolidation,20639.70,6.1,NaN,15.0,0.0,253460.0,427174.0,0.0,0.0

<li>Remove rows from the data that have <b style="color: red;">a too large of a loan</b> (Current Loan Amount should be less than 99999999)</li>

In [3]:
# Check shape
df.shape

(100514, 18)

In [4]:
# remove loans that are too large
df = df[df['Current Loan Amount'] < 99999999]
df.shape

(88516, 18)

<ul>
    <li>Remove rows that have the annual income as NaN (not a number)</li>
    <ul>
        <li><b>Extra task:</b> use imputation to use average income as the value instead of NaN</li>
    </ul>
</ul>

In [5]:
# Check columns that have NaN values
df.isna().sum()

Loan ID                             0
Loan Status                         0
Current Loan Amount                 0
Term                                0
Credit Score                    19154
Annual Income                   19154
Years in current job             3794
Home Ownership                      0
Purpose                             0
Monthly Debt                        0
Years of Credit History             0
Months since last delinquent    46788
Number of Open Accounts             0
Number of Credit Problems           0
Current Credit Balance              0
Maximum Open Credit                 2
Bankruptcies                      177
Tax Liens                           9
dtype: int64

In [6]:
# remove rows if annual income is NaN
df = df[df['Annual Income'].notnull()]
# Recheck NaN values
df.isna().sum()

Loan ID                             0
Loan Status                         0
Current Loan Amount                 0
Term                                0
Credit Score                        0
Annual Income                       0
Years in current job             2984
Home Ownership                      0
Purpose                             0
Monthly Debt                        0
Years of Credit History             0
Months since last delinquent    36320
Number of Open Accounts             0
Number of Credit Problems           0
Current Credit Balance              0
Maximum Open Credit                 1
Bankruptcies                      135
Tax Liens                           5
dtype: int64

In [7]:
# Recheck shape
df.shape

(69362, 18)

<li>Get the average Current Loan Amount</li>

In [8]:
# get the average current loan
avg = df['Current Loan Amount'].mean()
avg

314293.1817998328

<li>Get the highest and lowest Annual Income in the dataset</li>

In [9]:
# get highest annual income in dataset
max_income = df['Annual Income'].max()
max_income

165557393.0

In [10]:
# get lowest annual income in dataset
min_income = df['Annual Income'].min()
min_income

76627.0

<li>Get the Home Ownership value of the <b>Loan ID = bbf87a87-22cd-4d10-bd9b-7a9cc1b6e59d</b></li>

In [11]:
# get the needed value with the Loan ID
value = df[df['Loan ID'] == "bbf87a87-22cd-4d10-bd9b-7a9cc1b6e59d"]
value['Home Ownership']

491    Own Home
Name: Home Ownership, dtype: object

<li>Create a new field into your dataset called <b>Actual Annual Income</b>.</li>
<br><b>Note:</b> The Actual Annual Income follow this formula:<br>
<b style="color: green">Annual Income â€“ 12 * Monthly Debt</b><br><br>

In [12]:
# create a new field for Actual Annual income (annual income - 12 * monthly debt)
df['Actual Annual Income'] = df['Annual Income'] - df['Monthly Debt'] * 12
df.head()

,Loan ID,Loan Status,Current Loan Amount,Term,Credit Score,Annual Income,Years in current job,Home Ownership,Purpose,Monthly Debt,Years of Credit History,Months since last delinquent,Number of Open Accounts,Number of Credit Problems,Current Credit Balance,Maximum Open Credit,Bankruptcies,Tax Liens,Actual Annual Income
0,14dd8831-6af5-400b-83ec-68e61888a048,Fully Paid,445412.0,Short Term,709.0,1167493.0,8 years,Home Mortgage,Home Improvements,5214.74,17.2,NaN,6.0,1.0,228190.0,416746.0,1.0,0.0,1104916.12
3,77598f7b-32e7-4e3b-a6e5-06ba0d98fe8a,Fully Paid,347666.0,Long Term,721.0,806949.0,3 years,Own Home,Debt Consolidation,8741.90,12.0,NaN,9.0,0.0,256329.0,386958.0,0.0,0.0,702046.20
5,89d8cb0c-e5c2-4f54-b056-48a645c543dd,Charged Off,206602.0,Short Term,7290.0,896857.0,10+ years,Home Mortgage,Debt Consolidation,16367.74,17.3,NaN,6.0,0.0,215308.0,272448.0,0.0,0.0,700444.12
6,273581de-85d8-4332-81a5-19b04ce68666,Fully Paid,217646.0,Short Term,730.0,1184194.0,< 1 year,Home Mortgage,Debt Consolidation,10855.08,19.6,10.0,13.0,1.0,122170.0,272052.0,1.0,0.0,1053933.04
8,8af915d9-9e91-44a0-b5a2-564a45c12089,Fully Paid,548746.0,Short Term,678.0,2559110.0,2 years,Rent,Debt Consolidation,18660.28,22.6,33.0,4.0,0.0,437171.0,555038.0,0.0,0.0,2335186.64

<li>Get the Actual Annual Income of the loan with the <b>ID = 76fa89b9-e6a8-49af-afa1-8151315aba8e</b></li>

In [13]:
# Find if there are duplicate rows
df.duplicated().sum()

10215

In [14]:
# Drop duplicate rows
df = df.drop_duplicates()

In [15]:
# get the Actual Annual income for the needed ID
value2 = df[df['Loan ID'] == "76fa89b9-e6a8-49af-afa1-8151315aba8e"]
value2 = value2['Actual Annual Income']
value2.to_frame()

     Actual Annual Income
109             674234.76

<li>Get the Loan ID of the loan with the smallest Actual Annual Income </li>

In [16]:
# get loan ID of lowest actual annual income
id_value = df.loc[df['Actual Annual Income'].idxmin()]['Loan ID']
id_value

'fdda52f3-bbfa-45da-80b5-2bd9b68638ed'

<li>How many loans are "Long term"?</li>

In [17]:
# produce code that shows many loans are long term
long_loans = df[df['Term'] == 'Long Term']
# Print row count for long loans
len(long_loans.index)

16759

<li>How many loaners have more than 1 bankruptcy?</li>

In [18]:
# produce code that shows how many loaners have more than 1 bankruptcy
bank = df[df['Bankruptcies'] > 1].count()
# Print row count for loaners
len(bank.index)

19

<li>How many Short Term loans are for Home Improvements?</li>

In [19]:
# Filter from column 'Term' all 'Short Term' values
short_loans = df[df['Term'] == 'Short Term']
# Filter all with 'Home Improvements' values in 'Purpose' column
short_loans = short_loans['Purpose'] == 'Home Improvements'
# Print row count of short loans data frame
#short_loans.count()
len(short_loans.index)

42388

<li>How many unique loan purposes are there?</li>

In [20]:
# produce code that shows how many unique loan purposes there are
unique_loans = df['Purpose'].unique()
len(unique_loans)

16

<li>What are the 3 most common loan purposes?</li>

In [21]:
# produce code that shows the 3 most common loan purposes
loan_purposes = df['Purpose'].value_counts()
loan_purposes.to_frame().head(3)

                    count
Purpose
Debt Consolidation  46550
other                3587
Home Improvements    3403

<li>Is there a correlation between <b>Annual Income</b> and <b>Number of Open Accounts</b> or is there a correlation between <b>Number of Credit Problems</b> and <b>Bankruptcies</b>?</li>

In [22]:
# produce code that shows which correlation statement is true
# Correlation between Annual Income and Number of Open Accounts
cor1 = df['Annual Income'].corr(df['Number of Open Accounts'])

In [23]:
# Correlation between Number of Credit Problems and Bankruptcies
cor2 = df['Number of Credit Problems'].corr(df['Bankruptcies'])

In [24]:
# Helper function for correlation
def check_cor(value):
    if value > 0.3 and value < 0.9:
        return True
    else:
        return False

In [25]:
# Check correlation
check_cor(cor1)

False

In [26]:
# Check correlation
check_cor(cor2)

True

<h4><b>2. Download the purchases.csv from Moodle, and do the following observations:</b></h4>

<li>What was the total price sum of the Purchase Order Number 018H2015? (14 rows in total)</li>

In [27]:
# produce the code that gets the needed total price sum
df1 = pd.read_csv('purchases.csv')
df1.columns

Index(['Creation Date', 'Purchase Date', 'Fiscal Year', 'LPA Number',
       'Purchase Order Number', 'Requisition Number', 'Acquisition Type',
       'Acquisition Method', 'Department Name', 'Supplier Code',
       'Supplier Name', 'Supplier Qualifications', 'Supplier Zip Code',
       'CalCard', 'Item Name', 'Item Description', 'Quantity', 'Unit Price',
       'Total Price', 'Classification Codes', 'Normalized UNSPSC',
       'Commodity Title', 'Class', 'Class Title', 'Family', 'Family Title',
       'Segment', 'Segment Title', 'Location'],
      dtype='object')

In [28]:
df1.shape

(62657, 29)

In [29]:
# Check duplicates
df1.duplicated().sum()

151

In [30]:
# Drop duplicates
df1 = df1.drop_duplicates()

In [31]:
df1.shape

(62506, 29)

In [32]:
# Count order sum of individual order number
order_sum = df1[df1['Purchase Order Number'] == "018H2015"]['Total Price'].sum()
# Print sum and round it to 2 decimals
round(order_sum, 2)

1245.04

<li>What is the name and description of the purchased item with the Purchase Order Number 3176273?</li>

In [33]:
# produce the code that gets the needed name and description
# Get values based on purchase number
order_values = df1[df1['Purchase Order Number'] == "3176273"]
# Read only item name and description
order_values = order_values['Item Name'] + order_values['Item Description']
# Print values to frame
order_values.to_frame()

                            0
103  PC DesktopHP Prodesk 600

<li>How many occasions (rows) of purchase data happened during the year 2013?</li>

In [34]:
# produce the code that filters the needed data for year 2013
year_2013 = df1[df1['Fiscal Year'] == '2013-2014']
# Print row count
len(year_2013.index)

9493

<ul><li>What are the 5 most common Departments in the data?</li>
<ul><li><b>Extra task: </b>What are 3 Departments using most money in the data?</li></ul>
</ul>

In [35]:
# Get 5 most common departments name
common_5 = df1['Department Name'].value_counts().head(5)
# Print values to frame
common_5.to_frame()

                                               count
Department Name
Corrections and Rehabilitation, Department of  10862
Correctional Health Care Services               6591
Water Resources, Department of                  4567
Forestry and Fire Protection, Department of     4513
State Hospitals, Department of                  4258

In [36]:
# Extra task: 3 most common departments using most money
# FIXME: NOT WORKING
common_3 = df1[['Department Name', 'Total Price']].groupby(['Department Name','Total Price']).sum()
common_3

Empty DataFrame
Columns: []
Index: [(Administrative Law, Office of, 5000.0), (Administrative Law, Office of, 10000.0), (Administrative Law, Office of, 35000.0), (African American Museum, California, 5450.0), (African American Museum, California, 5677.0), (African American Museum, California, 6025.05), (African American Museum, California, 8530.4), (African American Museum, California, 9999.99), (African American Museum, California, 24000.0), (African American Museum, California, 43440.0), (Aging, Department of, 0.0), (Aging, Department of, 0.91), (Aging, Department of, 4.0), (Aging, Department of, 4.93), (Aging, Department of, 8.49), (Aging, Department of, 8.69), (Aging, Department of, 9.58), (Aging, Department of, 9.68), (Aging, Department of, 9.79), (Aging, Department of, 10.88), (Aging, Department of, 12.36), (Aging, Department of, 14.29), (Aging, Department of, 14.99), (Aging, Department of, 15.54), (Aging, Department of, 15.9), (Aging, Department of, 17.56), (Aging, Department of, 20.64), (Aging, Department of, 24.87), (Aging, Department of, 28.72), (Aging, Department of, 49.54), (Aging, Department of, 50.56), (Aging, Department of, 52.7), (Aging, Department of, 57.6), (Aging, Department of, 57.72), (Aging, Department of, 58.16), (Aging, Department of, 90.0), (Aging, Department of, 98.0), (Aging, Department of, 112.0), (Aging, Department of, 196.0), (Aging, Department of, 204.0), (Aging, Department of, 300.0), (Aging, Department of, 304.0), (Aging, Department of, 350.0), (Aging, Department of, 1074.0), (Aging, Department of, 1285.0), (Aging, Department of, 1644.0), (Aging, Department of, 1974.0), (Aging, Department of, 2520.0), (Aging, Department of, 2625.0), (Aging, Department of, 2930.0), (Aging, Department of, 7000.0), (Aging, Department of, 31930.0), (Aging, Department of, 82034.0), (Aging, Department of, 91149.0), (Aging, Department of, 100264.0), (Aging, Department of, 125863.0), (Aging, Department of, 150872.0), (Aging, Department of, 154954.0), (Aging, Department of, 182299.0), (Aging, Department of, 209965.0), (Aging, Department of, 264486.0), (Aging, Department of, 264653.0), (Aging, Department of, 320707.0), (Aging, Department of, 328407.0), (Aging, Department of, 364032.0), (Aging, Department of, 373713.0), (Aging, Department of, 397912.0), (Aging, Department of, 406878.0), (Aging, Department of, 460272.0), (Aging, Department of, 481619.0), (Aging, Department of, 531472.0), (Aging, Department of, 608537.0), (Aging, Department of, 685600.0), (Aging, Department of, 732901.0), (Aging, Department of, 738989.0), (Aging, Department of, 774770.0), (Aging, Department of, 783885.0), (Aging, Department of, 904666.0), (Aging, Department of, 922304.0), (Aging, Department of, 1075535.0), (Aging, Department of, 1088168.0), (Aging, Department of, 1100485.0), (Aging, Department of, 1351927.0), (Aging, Department of, 1498095.0), (Aging, Department of, 1760801.0), (Aging, Department of, 1765763.0), (Aging, Department of, 1949675.0), (Aging, Department of, 2054081.0), (Aging, Department of, 2225622.0), (Aging, Department of, 2356750.0), (Aging, Department of, 2519580.0), (Aging, Department of, 2774818.0), (Aging, Department of, 2801691.0), (Aging, Department of, 3235175.0), (Aging, Department of, 3931083.0), (Aging, Department of, 5754422.0), (Aging, Department of, 6730063.0), (Aging, Department of, 7663782.0), (Aging, Department of, 10380294.0), (Agricultural Labor Relations Board, 20.0), ...]

[49874 rows x 0 columns]

<li>Sort the data by Department Name</li>

In [37]:
# sort the data by department name
sorted_by_name = df1.sort_values('Department Name', axis=0, ascending=True)
sorted_by_name

,Creation Date,Purchase Date,Fiscal Year,LPA Number,Purchase Order Number,Requisition Number,Acquisition Type,Acquisition Method,Department Name,Supplier Code,...,Classification Codes,Normalized UNSPSC,Commodity Title,Class,Class Title,Family,Family Title,Segment,Segment Title,Location
519,11/30/2012,06/15/2012,2012-2013,NaN,11OAL09,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1657720.0,...,55101524,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"55123\n(44.807169, -93.136157)"
6,11/30/2012,06/15/2012,2012-2013,NaN,11OAL07,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1001493.0,...,55101524,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"95833\n(38.615723, -121.50562)"
20018,11/30/2012,06/15/2012,2012-2013,NaN,11OAL10,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1657720.0,...,55101524,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"55123\n(44.807169, -93.136157)"
31381,02/21/2013,03/20/2013,2012-2013,NaN,11-12201,NaN,NON-IT Services,Informal Competitive,"African American Museum, California",7341.0,...,82101801,82101801.0,Advertising campaign services,82101800.0,Advertising agency services,82100000.0,Advertising,82000000.0,Editorial and Design and Graphic and Fine Art ...,"90017\n(34.052895, -118.2642)"
666,01/02/2013,12/13/2011,2012-2013,NaN,11-12115,NaN,NON-IT Goods,Informal Competitive,"African American Museum, California",1748984.0,...,82151504,82151504.0,Sculptors services,82151500.0,Visual art services,82150000.0,Professional artists and performers,82000000.0,Editorial and Design and Graphic and Fine Art ...,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51643,06/20/2013,06/18/2013,2012-2013,NaN,4500199233,NaN,NON-IT Goods,Informal Competitive,"Water Resources, Department of",27490.0,...,39121529\n40151607,39121529.0,Contactors,39121500.0,Electrical controls and accessories,39120000.0,Electrical equipment and components and supplies,39000000.0,Electrical Systems and Lighting and Components...,"93307\n(35.277962, -118.942809)"
51637,06/21/2013,06/15/2013,2012-2013,NaN,4500199115,NaN,NON-IT Goods,Informal Competitive,"Water Resources, Department of",6523.0,...,46181503\n46182306,46181503.0,Protective coveralls,46181500.0,Safety apparel,46180000.0,Personal safety and protection,46000000.0,Defense and Law Enforcement and Security and S...,98733\n
14229,09/14/2012,09/14/2012,2012-2013,NaN,4500189319,NaN,NON-IT Goods,Informal Competitive,"Water Resources, Department of",1015614.0,...,31181503\n31181509\n31181504,31181503.0,Metal gaskets,31181500.0,Gaskets,31180000.0,Gaskets and seals,31000000.0,Manufacturing Components and Supplies,"92880\n(33.9357, -117.595283)"
51777,03/26/2014,03/25/2014,2013-2014,NaN,4500208992,NaN,NON-IT Goods,State Programs,"Water Resources, Department of",1743406.0,...,15101506,15101506.0,Gasoline or Petrol,15101500.0,Petroleum and distillates,15100000.0,Fuels,15000000.0,Fuels and Fuel Additives and Lubricants and An...,NaN
10047,08/25/2012,08/25/2012,2012-2013,1-10-75-55,4500188586,NaN,NON-IT Goods,Statewide Contract,"Water Resources, Department of",36519.0,...,14111507\n14111511\n14111514\n44121714\n312015...,14111507.0,Printer or copier paper,14111500.0,Printing and writing paper,14110000.0,Paper products,14000000.0,Paper Materials and Products,"94526\n(37.814603, -121.985857)"

<ul>
<li><b>Small extra tasks for extra points</b></li>
<ul>
<li>How many purchases in the data were IT Goods and had the total price more than 50000 dollars?</li>
<li>How many of the purchases have anything to do with IT? (IT Goods, IT Services, IT Telecommunications)</li>

</ul>
</ul>

In [38]:
# Extra Task
# How many purchases in the data were IT Goods and had the total price more than 50000 dollars?
# Check how many 'Acquisition Type' categories are there
categories = df1['Acquisition Type'].unique()
categories

array(['NON-IT Goods', 'NON-IT Services', 'IT Goods',
       'IT Telecommunications', 'IT Services'], dtype=object)

In [39]:
# Populate list with number values 0..4
cat_values = [x for x in range(5)]
# Create dictionary with ordinal category from categories and cat_values
category_mapper = {categories[i]: cat_values[i] for i in range(len(categories))}
# Check dictionary
category_mapper

{'NON-IT Goods': 0,
 'NON-IT Services': 1,
 'IT Goods': 2,
 'IT Telecommunications': 3,
 'IT Services': 4}

In [40]:
# Create new column for mapping 'Acquisition Type
df1['Acquisition Value'] = df1['Acquisition Type'].replace(category_mapper)
df1.head()

,Creation Date,Purchase Date,Fiscal Year,LPA Number,Purchase Order Number,Requisition Number,Acquisition Type,Acquisition Method,Department Name,Supplier Code,...,Normalized UNSPSC,Commodity Title,Class,Class Title,Family,Family Title,Segment,Segment Title,Location,Acquisition Value
0,09/05/2012,08/31/2012,2012-2013,NaN,4500149558,NaN,NON-IT Goods,Formal Competitive,"Corrections and Rehabilitation, Department of",48199.0,...,50405625.0,Jalapeno peppers,50405600.0,Peppers,50400000.0,Fresh vegetables,50000000.0,Food Beverage and Tobacco Products,"93706\n(36.675079, -119.865393)",0
1,10/18/2012,10/18/2012,2012-2013,NaN,4500156192,NaN,NON-IT Goods,Informal Competitive,"Corrections and Rehabilitation, Department of",1327540.0,...,50301541.0,Ida red apples,50301500.0,Apples,50300000.0,Fresh fruits,50000000.0,Food Beverage and Tobacco Products,"91360\n(34.210392, -118.874313)",0
2,10/17/2012,10/17/2012,2012-2013,NaN,4500156124,NaN,NON-IT Goods,Fair and Reasonable,Correctional Health Care Services,45803.0,...,55101506.0,Magazines,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"95827\n(38.563097, -121.328511)",0
3,10/30/2012,10/24/2012,2012-2013,NaN,S2556056,NaN,NON-IT Goods,Informal Competitive,"Parks & Recreation, Department of",1746707.0,...,10121505.0,Hay,10121500.0,Livestock feed,10120000.0,Animal feed,10000000.0,Live Plant and Animal Material and Accessories...,NaN,0
4,11/14/2012,11/14/2012,2012-2013,NaN,4500159228,NaN,NON-IT Goods,Informal Competitive,"Corrections and Rehabilitation, Department of",1065902.0,...,50201706.0,Coffee,50201700.0,Coffee and tea,50200000.0,Beverages,50000000.0,Food Beverage and Tobacco Products,"95696\n(38.43, -122.02)",0

In [41]:
# Now using mapping column query is possible
purchases = df1.query("`Acquisition Value` == 2 and `Total Price` > 50000")
# Print length of array
len(purchases.index)

698

In [42]:
# Extra Task
# How many of the purchases have anything to do with IT?
# (IT Goods, IT Services, IT Telecommunications)
it_purchases = df1.query("`Acquisition Value`.between(2, 4)")
# Check if query is succesfull
it_purchases['Acquisition Type'].unique()

array(['IT Goods', 'IT Telecommunications', 'IT Services'], dtype=object)

In [43]:
# Print row count of it_purchases
len(it_purchases.index)

9526

<ul>
<li><b>Other extra tasks for extra points</b></li>
<ul>
<li>Create a new DataFrame, where you have filtered out purchases that have a Total Price of 0 or less</li>
<li>For this DataFrame, use groupby() â€“function twice to group the purchases data by Acquisition Type, and then calculating the result first by sum() and then by mean()</li>
<li>Which two acquisition types have the largest sums and means after grouping the data?</li>
</ul>
</ul>

<h4><b>3. Download the data_salaries_india.csv from Moodle, and consider the following questions of the data. Use any means in pandas (or even NumPy) you wish to explain your answers.</b></h4>

<ul>
<li>Before we can do anything with the salaries, we have to convert them into something more usable</li>
<ul>
<li>Note: the salaries can be yearly, monthly or hourly salaries</li>
<ul>
<li>We don't also need the Indian rupee â€“sign (â‚¹)</li>
</ul>
<li>You can use the template in Moodle to help you out with this (Salary filtering, pandas exercise 3)</li>
</ul>
</ul>

In [44]:
# Read csv file
df2 = pd.read_csv('data_salaries_india.csv')
df2.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Salary
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,"â‚¹11,71,687/yr"
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,"â‚¹32,57,305/yr"
2,Tempworks Services,Data Scientist,Manager,1,Bangalore,"â‚¹58,11,205/yr"
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,"â‚¹11,80,965/yr"
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,"â‚¹6,02,930/yr"

In [45]:
# Helper function converting salary to yearly integers
def salary_converter(row):
    # Last two characters determine salary span (yr, mo, hr)
    span = row['Salary'][-2]
    # Remove commas and combine numbers
    number = int(''.join(filter(str.isdigit, row['Salary'])))

    # Find out if salary is other than yearly
    if span == "hr":
        # Average work hours per year is 2117.01 in India
        number = int(number * 2117.01)
    elif span == "mo":
        # Multiply by 12 months
        number = int(number * 12)

    # Return yearly salary in integer format
    return number

In [46]:
# convert the salaries as needed
df2['Yearly Salary'] = df2.apply(salary_converter, axis=1)

<ul>
<li>What are the most common values in different fields (Job Titles, Companies, Location)? <b>Based on the distribution, is the data balanced or not?</b></li>
<ul>
<li><b>Extra task:</b> there seem to be some Job Titles that are almost the same, like "Machine Learning Data Associate" and "Machine Learning Associate", combine these into something common</li>
</ul>
</ul>

In [47]:
# produce the code that shows the most common values in different fields
# and answer the question about the distribution
df2[['Job Title', 'Company Name', 'Location']].describe()

             Job Title               Company Name   Location
count             5127                       5123       5127
unique              28                       2523          5
top     Data Scientist  Tata Consultancy Services  Bangalore
freq              2165                         51       1858

In [48]:
# Check common statistical features
df2.describe().astype('int64')

       Salaries Reported  Yearly Salary
count               5127           5127
mean                   2        1232570
std                    4        1816491
min                    1          10814
25%                    1         462977
50%                    1         823971
75%                    2        1435941
max                  105       74445327

Looks like there is outliers because standard deviation is large compared to mean. Also minimum and maximum values are far from mean.

<li>Are there any outliers in the data that might affect the averages negatively (certain salaries)? Manage the outliers as you best see fit (either remove them or leave them, based on your analysis) </li>

In [49]:
# Let's do some cleaning
from scipy import stats

In [50]:
# Take only yearly salary for inspection
yearly = df2[['Yearly Salary']]

In [51]:
# Apply zscore and remove all values outside value 3 for standard deviation
yearly = yearly[(np.abs(stats.zscore(yearly)) < 3).all(axis=1)]
# Check what we got
yearly.describe().astype('int64')

       Yearly Salary
count           5068
mean         1110742
std          1003757
min            10814
25%           458143
50%           811676
75%          1397992
max          6647045

Now with outliers removed, salary data is much cleaner because mean and standard deviation are closer to each other. Looks like large salary values were more common than smaller ones. So we can remove salaries larger than 3349478 from orginal data.

In [52]:
# Remove max outliers based on analysis
df2 = df2[df2['Yearly Salary'] < 3349479]
# Drop also old salary column
df2 = df2.drop('Salary', axis=1)
df2.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Yearly Salary
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,1171687
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,3257305
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,1180965
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,602930
5,Algo Engines,Data Engineer,Specialist,1,Mumbai,1200000

<ul>
<li>If we want to correlate upon categories (ordinal or binary), we need to use factorize(). <b>Factorize the Role-column, and add the new column to the DataFrame.</b></li>
<ul>
<li><b>Note:</b> using <b>factorize()</b> for nominal categories (Job Title, Location, Company Name) doesn't work well, because the numbers do not have any numeric magnitude. In other words, these categories don't measure anything, they just group data, so numerical comparison / correlation doesn't mean anything statistically.</li>
</ul>
</ul>

In [53]:
# Check Role column for unique values
df2['Role'].unique()

array(['Specialist', 'Manager'], dtype=object)

In [54]:
# Use factorize to assign number for each category
role_values, role_names = pd.factorize(df2['Role'], sort=False)
# Add assigned numbers to new column in df
df2['Role Values'] = role_values

In [55]:
# Check data
df2.head()

,Company Name,Job Title,Role,Salaries Reported,Location,Yearly Salary,Role Values
0,Axis Bank,Data Scientist,Specialist,3,Bangalore,1171687,0
1,Globex Digital Solutions,Machine Learning Engineer,Manager,1,Hyderabad,3257305,1
3,BlueOptima,Machine Learning Engineer,Specialist,2,Bangalore,1180965,0
4,Dell Technologies,Data Analyst,Specialist,5,New Delhi,602930,0
5,Algo Engines,Data Engineer,Specialist,1,Mumbai,1200000,0

In [56]:
# Remove old Role column
df2 = df2.drop('Role', axis=1)

In [57]:
# Check again
df2

,Company Name,Job Title,Salaries Reported,Location,Yearly Salary,Role Values
0,Axis Bank,Data Scientist,3,Bangalore,1171687,0
1,Globex Digital Solutions,Machine Learning Engineer,1,Hyderabad,3257305,1
3,BlueOptima,Machine Learning Engineer,2,Bangalore,1180965,0
4,Dell Technologies,Data Analyst,5,New Delhi,602930,0
5,Algo Engines,Data Engineer,1,Mumbai,1200000,0
...,...,...,...,...,...,...
5120,Mahindra,Data Analyst,1,Mumbai,1000000,0
5121,Boston Consulting Group,Data Scientist,1,Bangalore,872604,0
5122,Rejolut,Machine Learning Engineer,1,Mumbai,513690,0
5123,Bartleby Technologies,Machine Learning Engineer,1,Bangalore,1309535,0
5126,Unilever,Data Scientist,2,Bangalore,1705561,0

<ul>
<li><b>Finally, check out the correlations. Does anything correlate with anything? Can we make any assumptions?</b></li>
<ul>
<li>Tip: When correlating against binary variables, sometimes the Spearman correlation might be more sensitive, in pandas:</li>
</ul>
</ul>

In [58]:
# Check correlations with Spearman
df2.corr(numeric_only=True, method='spearman')

                   Salaries Reported  Yearly Salary  Role Values
Salaries Reported           1.000000      -0.015307    -0.223184
Yearly Salary              -0.015307       1.000000     0.333731
Role Values                -0.223184       0.333731     1.000000

In [59]:
# Check correlations with Pearson
df2.corr(numeric_only=True, method='pearson')

                   Salaries Reported  Yearly Salary  Role Values
Salaries Reported           1.000000      -0.052586     -0.09979
Yearly Salary              -0.052586       1.000000      0.39966
Role Values                -0.099790       0.399660      1.00000

#### Looks like Yearly Salary and Role Values have some positive correlation.

<b>Extra tasks for this dataset</b><br><br>

<ul>
<li>After all salaries have been converted to correct format by using the helper function (check Moodle), use quantiles and split the data into four different parts:</li>
<ul>
<li><span style="color: red;">Top 25%</span><br>=> quantile(0.75)</li>
<li><span style="color: red;">Above average, values between top 25-50%</span><br>
=> quantile(0.5)  - quantile(0.75)</li>
<li><span style="color: red;">Below average, values between top 50-75% </span><br>
=> quantile(0.25) â€“ quantile(0.5)
</li>
<li><span style="color: red;">Bottom 25%</span><br>=> quantile(0.25)</li>
<br>
<li>What are the salary ranges for each quantile?</li><li>
See examples in pandas-materials on how to use quantiles
</li>
</ul>
</ul>
<hr>

<ul>
<li>Did you get any ideas how this data could be improved? Do we need some particular new data or some other operations on the data? Should we filter something out based on some other column?<br><br><b>Provide arguments for your answers in code comments.</b><br><br> </li>
<ul>
<li>Note: There are many good possible answers here!</li>
<li>Tip: How about replacing the "Salaries Reported" column with actual rows based on that number? Try doing this with the data!</li>
<li>Remember: This data only represents data engineering salaries based on selected Indian cities.
The world is a vast place :)
</li>
</ul>
</ul>

In [60]:
# code for the extra tasks


<h2><b>Advanced extra tasks for extra points (varying challenges, some require Googling):</b></h2>

<ul>
<li><b>1. Data merge is a useful tool when you have multiple files of data that have the exact same structure.</b><br><br>Download the two csv-files from Moodle (videogames1.csv, videogames2.csv), and combine them into one Data Frame. Lastly, save the Data Frame into a new csv-file => combined.csv.</li>
</ul>

In [66]:
# code for the advanced extra task
# Read csv files to data frames, use index column
df_video1 = pd.read_csv('videogames1.csv', index_col=0)
df_video2 = pd.read_csv('videogames2.csv', index_col=0)

In [67]:
# Combine two scv files into one
df_combi = pd.concat([df_video1, df_video2])
df_combi

,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76.0,51.0,8.0,322.0,Nintendo,E
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,NaN,NaN,NaN,NaN,NaN,NaN
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.68,12.76,3.79,3.29,35.52,82.0,73.0,8.3,709.0,Nintendo,E
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.61,10.93,3.28,2.95,32.77,80.0,73.0,8.0,192.0,Nintendo,E
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8359,Samurai Warriors: Sanada Maru,PS3,2016.0,Action,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8360,LMA Manager 2007,X360,2006.0,Sports,Codemasters,0.00,0.01,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8361,Haitaka no Psychedelica,PSV,2016.0,Adventure,Idea Factory,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8362,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8363,Winning Post 8 2016,PSV,2016.0,Simulation,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN

In [68]:
# Save concat file to scv
df_combi.to_csv('combined.csv')

<ul>
<li><b>2. Functions and lambdas allow us to extend the operations we wish to do to columns and rows in pandas. </b><br><br>For example, the built-in functions may not be enough in all cases. Use the data of exercise 1 (loans.csv), and create a new column called "Income Group" that holds a text value. <br><br>Create either a function or a lambda, that determines the True or False â€“value based on the Annual Income â€“column. Use the following table to create the values:</li>
</ul>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_3.png"/>

<li>After creating the function/lambda, you can use it by using pandas' .apply() â€“function.<br><br></li>

<li>Finally, get the amount of rows grouped by each of the new Income Group â€“field values and print them out.</li>

In [64]:
# code for the advanced extra task

<ul>
<li><b>3.	Normalization allows us to convert the values of numeric columns to be between 0 and 1.</b> This is helpful when two different numbers seem to follow the same trend, but have completely different value ranges. For example, gold and silver prices tend to follow similar patterns, but their market worth is quite different. By using normalization, we can compare these trends more easily. <br>

Get historical prices of both gold and silver, and compare them without and with normalization. You can plot the prices by using df.plot() â€“function. Check the dataset in list in Moodle for some alternatives for gold and silver prices.
</li>
</ul>
<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_4.png" />

<ul>
<li><b>4.	Create an account to kaggle.com, and find any dataset that interests you. </b><br>

There's a list of possibly interesting datasets listed in Moodle as well.
<br><br>
<b>Try to find interesting features in data, in particular:</b>
</li>
<ul>
<li>Clean up data first (rows with too many NaN â€“values), values that are way too big or small, insignificant columns etc.)</li>
<li>You can create new columns as well if it seems suitable! (either by using functions or other means)</li>
<li>Interesting correlations (.corr() â€“function) and other interesting features in the data. Is something surprising in the data?</li>
<li><b>Note: </b>There are many ways on how to approach this exercise.</li>
</ul>
</ul>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_5.png" />

In [65]:
# do any Kaggle.com -related extra tasks in their own Jupyter notebooks for easier coding